<?php


namespace suptime\bdxasset\Utils;


class Codes
{
    //公共错误码 (下表列出了百度数字藏品API的公共错误码)
    const PUBLIC_CODES = [
        40001 => '参数错误',
        40002 => '签名错误',
        40003 => '钱包地址和公钥不匹配',
        40004 => '签名过期',
        40100 => '没有权限',
        40300 => '拒绝请求',
        40303 => '资产未发行，不允许上架',
        40311 => '资产已存在，不允许重复创建',
        40312 => '资产状态错误，不允许操作',
        40313 => '资产重复发行',
        40314 => '资产库存不足',
        40315 => '碎片状态错误，不允许操作',
        40342 => '百度智能云账户费用状态异常',
        40343 => '服务已暂停',
        40400 => '资源未找到',
        40401 => '文件不存在',
        40402 => '资产不存在',
        50000 => '服务内部错误',
        50002 => '创建重复资产',
        50100 => '未实现接口',
    ];

    //资产状态 (当用户访问API成功后，会返回给用户相应的资产或者碎片的状态。便于及时了解资产和碎片状态)
    const ASSET_STATUS = [
        1 => '初始化',
        3 => '发行中',
        4 => '发行成功',
        5 => '冻结中',
        6 => '已冻结',
        7 => '封禁中',
        8 => '已封禁',
        9 => '已删除',
    ];

    //碎片状态
    const DEBRIS_STATUS = [
        0 => '已上链',
        1 => '授予中',
        4 => '转移中',
        5 => '核销中',
        6 => '已核销',
    ];
}
